{"page_content": "![](https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/default-banner.jpg)\n\n# Forms\n\nPlease note that these forms are intended for the exclusive use of businesses that do not have an address in Québec and individuals.\n\nIn accordance with the SAAQ’s language policy, forms intended for SAAQ employees and Québec businesses are only available in French. For a complete list of all our forms, please refer to the French version of this page.\n\nCitizens\n\n\nBusinesses and Organizations\n\n\n- ### TOP 5\n\n\n\n\n\n\n#### [Accessible Parking Permit Application (PDF, 411.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/disabled-parking-permit-application.pdf)\n\n\n\nComplete this form if you wish to apply for an accessible parking permit for an automobile, or for a motorcycle, moped or scooter.\n\n\n\n\n\n\n\n#### [Application for Review – Compensation (PDF, 125.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/application-review-form.pdf)\n\n\n\nComplete this form if you wish to contest a decision rendered regarding compensation or rehabilitation measures.\n\n\n\n\n\n\n\n#### [Consent of a Person Having Parental Authority (PDF, 128.7 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/parental-authority-form.pdf)\n\n\n\nComplete this form if you are the father, mother or legal guardian of a minor who wants to obtain a driver’s licence or register a vehicle.\n\n\n\n\n\n\n\n#### [Power of Attorney (Natural Person Only) (PDF, 657.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/power-attorney-form.pdf)\n\n\n\nThis form is for individuals (natural persons) only and cannot be used by businesses. It must be completed and signed by the person who wishes to authorize someone to carry out an operation at an SAAQ service outlet on their behalf.\n\n\n\n\n\n\n\n#### [Vehicle Record Request (PDF, 218.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/vehicle-record-request.pdf)\n\n\n\nComplete this form if you would like information on a used vehicle.\n\n- ### Driver’s Licence\n\n\n\n\n\n\n#### [Alcofrein Program Enrolment (PDF, 105.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/alcofrein-program-enrolment.pdf)\n\n\n\nForm to be completed by customer service and the Service du suivi du privilège de circuler to register a client with the Alcofrein program.\n\n\n\n\n\n\n\n#### [Application for Review - Suspension of a Licence or the Right to Obtain One (PDF, 172.6 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/suspension-review-application.pdf)\n\n\n\nComplete this form if you have been convicted of impaired driving or excessive speeding and wish to have the suspension of your driver’s licence lifted.\n\n\n\n\n\n\n\n#### [Application for the Driver's Abstract of a Person Residing or Temporarily Living Outside Québec (PDF, 127.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/driver-outside-quebec-form.pdf)\n\n\n\nComplete this form if you currently reside or are staying outside Québec and wish to obtain a copy of your driving record.\n\n\n\n\n\n\n\n#### [Application for Vehicle Release from Seizure (PDF, 136.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/application-vehicle-release-seizure.pdf)\n\n\n\nComplete this form if you wish to recover your vehicle before the end of the 30-day seizure and impoundment period.\n\n\n\n\n\n\n\n#### [Application to Have a Conduct Record Adjusted – Heavy Vehicle Owners, Operators or Drivers (PDF, 137.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/application-conduct-record-adjusted-hvood.pdf)\n\n\n\nThis form is for any heavy vehicle owners, operators or drivers who wish to apply to have an adjustment made to their conduct record.\n\n\n\n\n\n\n\n#### [Cancellation of the Registration of a Vehicle Licensed or Sold Outside Québec and/or a Driver’s Licence (PDF, 132.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/cancellation-registration-vehicule-licensed-sold-outside-quebec.pdf)\n\n\n\nComplete this form if you wish to cancel the registration of a vehicle licensed or sold outside Québec, or cancel your driver’s licence if you were issued a licence from another jurisdiction.\n\n\n\n\n\n\n\n#### [Consent of a Person Having Parental Authority (PDF, 128.7 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/parental-authority-form.pdf)\n\n\n\nComplete this form if you are the father, mother or legal guardian of a minor who wants to obtain a driver’s licence or register a vehicle.\n\n\n\n\n\n\n\n#### [Driver’s Licence Cancellation (PDF, 186.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/driver-licence-cancellation.pdf)\n\n\n\nComplete this form if you wish to cancel a driver’s licence for one of the following reasons: you no longer wish to drive, your licence has been suspended or revoked, or the licence holder is deceased.\n\n\n\n\n\n\n\n#### [Driver’s Licence Renewal While Outside Québec (PDF, 183.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/driver-licence-renewal-while-outside-quebec.pdf)\n\n\n\nComplete this form to renew your driver’s licence during an out-of-province stay.\n\n\n\n\n\n\n\n#### [Driver’s Licence Replacement While Outside Québec (PDF, 188.6 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/driver-licence-replacement-while-outside-quebec.pdf)\n\n\n\nComplete this form to replace your driver’s licence during an out-of-province stay.\n\n\n\n\n\n\n\n#### [Power of Attorney (Natural Person Only) (PDF, 657.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/power-attorney-form.pdf)\n\n\n\nThis form is for individuals (natural persons) only and cannot be used by businesses. It must be completed and signed by the person who wishes to authorize someone to carry out an operation at an SAAQ service outlet on their behalf.\n\n\n\n\n\n\n\n#### [Registration Form for the Program to Assess and Reduce the Risk of Impaired Driving (PERRCCA) (PDF, 196.3 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/registration-form.pdf)\n\n\n\nForm to be completed by anyone who wishes to register by mail for an assessment with our partner organization, the Centre intégré universitaire de santé et de services sociaux (CIUSSS) du Centre-Sud-de-l’Île-de-Montréal.\n\n\n\n\n\n\n\n#### [Report on a Person’s State of Health (28) (PDF, 287.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/medical-examination-report-28.pdf)\n\n\n\nThis report serves to assess a driver’s overall state of health.\n\n\n\n\n\n\n\n#### [Request for Analysis – Authorized Driver’s Permit or Registration with a Transportation System Operator (PDF, 251.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/request-analysis-authorized-driver-permit.pdf)\n\n\n\nThis form is intended for individuals requesting a criminal record check for the purpose of obtaining or renewing an authorized driver's permit or their registration with a transportation system operator.\n\n\n\n\n\n\n\n#### [Self-Declaration of Medical Information (PDF, 145.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/self-declaration-medical-information.pdf)\n\n\n\nForm to be completed by an individual in order to report any new health problems, or when applying for a driver’s licence or to add a new class to an existing licence.\n\n- ### Vehicle Registration\n\n\n\n\n\n\n#### [Application for Exemption from the Prohibition from Putting into Operation, Acquiring, Renting, Leasing or Registering a Road Vehicle – Person Eligible for the Alcohol Ignition Interlock Device Program (PDF, 179.7 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/prohibition-exemption-application.pdf)\n\n\n\nThis form is for persons who are subject to a penalty prohibiting them from putting into operation, acquiring, renting, leasing or registering a road vehicle (ROA penalty) and who wish to have an exemption that would allow them to put into operation, acquire, lease and register a road vehicle or vehicles.\n\n\n\n\n\n\n\n#### [Application for Exemption from the Prohibition from Putting into Operation, Acquiring, Renting, Leasing or Registering a Road Vehicle – With Removable Licence Plates and Vehicle Driven by a Third Party (PDF, 121.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/property-damage-insurance.pdf)\n\n\n\nComplete this form if you are a vehicle owner or operator whose licence is currently under penalty and you wish to apply for an exemption that would allow you to put into operation (dealer plates), acquire, lease and register one or more vehicles so that they can be operated by a third party in the course of your business’s activities.\n\n\n\n\n\n\n\n#### [Application for Vehicle Release from Seizure (PDF, 136.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/application-vehicle-release-seizure.pdf)\n\n\n\nComplete this form if you wish to recover your vehicle before the end of the 30-day seizure and impoundment period.\n\n\n\n\n\n\n\n#### [Application for Veteran's Licence Plate Eligibility Certification (PDF, 287.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/application-veteran-licence-plate-eligibility-certification.pdf)\n\n\n\nForm that allows an applicant to provide the information required to certify his or her eligibility for a veteran’s licence plate.\n\n\n\n\n\n\n\n#### [Cancellation of the Registration of a Vehicle Licensed or Sold Outside Québec and/or a Driver’s Licence (PDF, 132.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/cancellation-registration-vehicule-licensed-sold-outside-quebec.pdf)\n\n\n\nComplete this form if you wish to cancel the registration of a vehicle licensed or sold outside Québec, or cancel your driver’s licence if you were issued a licence from another jurisdiction.\n\n\n\n\n\n\n\n#### [Change of Vehicle Registration for a Heavy Trailer to Be Recognized as a Travel Trailer (PDF, 509.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/change-vehicle-registration-heavy-trailer-recognized-travel-trailer.pdf)\n\n\n\nThis form is intended for any individual who wishes to apply to change the vehicle registration of a heavy trailer that has been converted into a travel trailer. Acceptance of this change by the SAAQ means that the vehicle will no longer be required to undergo an annual mechanical inspection.\n\n\n\n\n\n\n\n#### [Consent of a Person Having Parental Authority (PDF, 128.7 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/parental-authority-form.pdf)\n\n\n\nComplete this form if you are the father, mother or legal guardian of a minor who wants to obtain a driver’s licence or register a vehicle.\n\n\n\n\n\n\n\n#### [Declaration by the Liquidator of the Succession (PDF, 173.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/declaration-transfer-ownership-death.pdf)\n\n\n\nComplete this form if you are the liquidator of the succession or the representative of the heirs and you wish to request the transfer of ownership of one or more vehicles belonging to the deceased.\n\n\n\n\n\n\n\n#### [Power of Attorney (Natural Person Only) (PDF, 657.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/power-attorney-form.pdf)\n\n\n\nThis form is for individuals (natural persons) only and cannot be used by businesses. It must be completed and signed by the person who wishes to authorize someone to carry out an operation at an SAAQ service outlet on their behalf.\n\n\n\n\n\n\n\n#### [Request for a Mechanical Inspection Certificate (PDF, 155.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/request-mechanical-inspection-certificate.pdf)\n\n\n\nThis form is for the exclusive use of vehicle owners in remote areas who wish to obtain a mechanical inspection certificate.\n\n\n\n\n\n\n\n#### [Vehicle Record Request (PDF, 218.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/vehicle-record-request.pdf)\n\n\n\nComplete this form if you would like information on a used vehicle.\n\n- ### Traffic Accident\n\n\n\n\n\n\n#### [Application for Review – Compensation (PDF, 125.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/application-review-form.pdf)\n\n\n\nComplete this form if you wish to contest a decision rendered regarding compensation or rehabilitation measures.\n\n\n\n\n\n\n\n#### [Attestation of a Missed School Year or Term Due to the Accident (PDF, 173.3 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/attestation-missed-school-year-due-accident.pdf)\n\n\n\nForm that allows accident victims to attest to the loss of a school year or term.\n\n\n\n\n\n\n\n#### [Attestation of Expenses for Personal Home Assistance (PDF, 309.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/attestation-expenses-home-assistance.pdf)\n\n\n\nForm to request the payment of expenses for personal home assistance if the accident victim is unable to attend to personal care or perform essential activities of daily life without assistance.\n\n\n\n\n\n\n\n#### [Attestation of Expenses Incurred for Personal Assistance During a Temporary Leave From a Rehabilitation or Residential Centre (PDF, 209.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/rehabilitation-expenses-attestation.pdf)\n\n\n\nForm to request the payment of expenses for personal assistance during temporary leave from a rehabilitation or residential care centre. The accident victim must be unable to attend to personal care or perform essential activities of daily life without assistance.\n\n\n\n\n\n\n\n#### [Attestation of Income by the Employer and Job Description (PDF, 353.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/employer-income-attestation.pdf)\n\n\n\nForm to be filled out by the employer of an accident victim who held full-time or part-time employment at the time of the accident and who is unable to hold that employment or was unable to hold it for more than 7 days after the accident.\n\n\n\n\n\n\n\n#### [Attestation of School Attendance for Students Aged 16 or Older (PDF, 317.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/school-attendance-attestation.pdf)\n\n\n\nForm to be filled out by the educational institution of an accident victim age 16 or older who was a student on a full-time basis.\n\n\n\n\n\n\n\n#### [Attestation of School Attendance – Claim for Death Benefits (PDF, 195.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/school-attendance-death-attestation.pdf)\n\n\n\nForm to be filled out by the educational institution of an accident victim age 16 or older who was a full-time student or a dependent age 18 or older who was a full-time student.\n\n\n\n\n\n\n\n#### [Authorization to Communicate Information Pertaining to Personal Income (PDF, 131.3 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/authorization-communicate-information-pertaining-personal-income.pdf)\n\n\n\nThis form is used to obtain an accident victim’s authorization so that Revenu Québec may provide us with all the information contained in his or her tax returns.\n\n\n\n\n\n\n\n#### [Authorization to Disclose Information by Telephone (PDF, 132.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/authorization-disclose-information-telephone.pdf)\n\n\n\nThis form is used to authorize the SAAQ to contact, by telephone, a person you have designated in order to provide general information concerning your claim file. This authorization excludes medical information.\n\n\n\n\n\n\n\n#### [Authorization to Disclose Medical Information (PDF, 96.4 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/authorization-disclose-medical-information.pdf)\n\n\n\nForm that allows accident victims to authorize an assessing physician, health professional, compensation officer or accident victim counsellor to disclose medical information concerning them to another health care professional, including their attending physician.\n\n\n\n\n\n\n\n#### [Authorization to Obtain and Disclose Personal Information in the Case of Property Damage (PDF, 139.4 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/authorization-personal-information-property-damage.pdf)\n\n\n\nThis form is used to authorize the SAAQ to share information or documents concerning property damage to a vehicle with other persons or organizations in the event of a hit-and-run accident.\n\n\n\n\n\n\n\n#### [Availability Allowance and Expenses Incurred by the Accompanying Person (PDF, 355.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/accompanying-person-allowance.pdf)\n\n\n\nThe person who accompanies an accident victim, or who is required to be present, can use this form to claim an availability allowance, as well as travel, meal and lodging expenses.\n\n\n\n\n\n\n\n#### [Claim for Compensation For Accident-Related Expenses (PDF, 558.3 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/compensation-claim-accident-expenses.pdf)\n\n\n\nComplete this claim for compensation form if your disability period lasted 7 or fewer days.\n\n\n\n\n\n\n\n#### [Claim for Compensation For an Inability to Perform Activities and for Accident-Related Expenses (PDF, 1.0 MB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/compensation-claim-inability.pdf)\n\n\n\nComplete this claim for compensation form if your disability period lasts for 8 days or more.\n\n\n\n\n\n\n\n#### [Claim for Death Benefits (PDF, 763.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/death-benefits-claim.pdf)\n\n\n\nComplete this form when a traffic accident results in death.\n\n\n\n\n\n\n\n#### [Claim for Property Damage (PDF, 248.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/property-damage-claim.pdf)\n\n\n\nThis form is used to file a claim for property damage in the event of a hit-and-run accident.\n\n\n\n\n\n\n\n#### [Claim for Property Damage – Eligibility Criteria (Guide) (PDF, 128.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/claim-property-damage-guide.pdf)\n\n\n\nThis guide describes the eligibility criteria for filing a claim with the SAAQ for property damage involving a vehicle in the event of a hit-and-run accident.\n\n\n\n\n\n\n\n#### [Confirmation of an Employment-Assistance Allowance Lost (PDF, 131.7 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/confirmation-employment-assistance-allowance-lost.pdf)\n\n\n\nForm to be filled out by a Québec local employment centre if an accident victim was receiving an employment-assistance allowance at the time of the accident.\n\n\n\n\n\n\n\n#### [Confirmation of Hiring (PDF, 141.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/hiring-confirmation-form.pdf)\n\n\n\nForm to be filled out by the employer of an accident victim who had guaranteed employment that he or she would have held had the accident not occurred.\n\n\n\n\n\n\n\n#### [Declaration of Lost Salary or Wages (PDF, 227.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/declaration-lost-salary-wages.pdf)\n\n\n\nForm that establishes the lost salary or wages for an individual who is eligible for compensation following an accident and who must leave work for the purposes of receiving treatment or for medical consultations.\n\n\n\n\n\n\n\n#### [Direct Deposit Request — Bank and credit union accounts in Canada only (PDF, 234.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/direct-deposit-request.pdf)\n\n\n\nComplete this form if you receive compensation and wish to register for direct deposit or change your banking information.\n\n\n\n\n\n\n\n#### [Evaluation of Personal Home Assistance Needs (PDF, 368.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/evaluation-personal-home-assistance-needs.pdf)\n\n\n\nForm that allows accident victims to describe their condition and needs that may entitle them to a reimbursement of expenses incurred for personal home assistance services.\n\n\n\n\n\n\n\n#### [Follow-up on the Accident Victim's Dependants (PDF, 114.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/follow-up-accident-victims-dependants.pdf)\n\n\n\nThis form is used to declare the school enrolment of an accident victim’s dependants as part of their compensation claim follow-up.\n\n\n\n\n\n\n\n#### [Guide to the Claim for Compensation — For Accident-Related Expenses (PDF, 162.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/compensation-claim-guide-accident-expenses.pdf)\n\n\n\nUse this guide to help you complete your claim for compensation (disability period lasting 7 or fewer days).\n\n\n\n\n\n\n\n#### [Guide to the Claim for Compensation — For an Inability to Perform Activities and for Accident-Related Expenses (PDF, 369.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/compensation-claim-guide-inability.pdf)\n\n\n\nUse this guide to help you complete your claim for compensation (disability period lasting 8 days or more).\n\n\n\n\n\n\n\n#### [Guide to the Claim for Death Benefits (PDF, 422.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/death-benefits-claim-guide.pdf)\n\n\n\nUse this guide to help you complete your claim for death benefits.\n\n\n\n\n\n\n\n#### [Health Care-Related Travel Expenses (PDF, 558.3 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/travel-expenses-care-form.pdf)\n\n\n\nComplete this form to claim travel, meal and lodging expenses incurred in order to receive care or undergo treatment.\n\n\n\n\n\n\n\n#### [Job Description (PDF, 156.6 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/job-description.pdf)\n\n\n\nForm to be filled out by the accident victim’s employer to provide a detailed description of the accident victim’s employment and its context. The information provided helps determine whether injuries and limitations prevent the accident victim from holding his or her employment.\n\n\n\n\n\n\n\n#### [Job Description – Self-Employed Worker (PDF, 160.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/job-description-self-employed-worker.pdf)\n\n\n\nForm to be filled out by the self-employed accident victim to provide a detailed description of his employment and its context. The information provided helps determine whether injuries and limitations prevent the accident victim from holding his or her employment.\n\n\n\n\n\n\n\n#### [Self-Employed Income and Job Description (PDF, 217.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/self-employed-income.pdf)\n\n\n\nForm to be completed by an accident victim who was self-employed at the time of the accident, for the purposes of calculating the income replacement indemnity.\n\n\n\n\n\n\n\n#### [Signature of the Claim for Compensation (PDF, 128.4 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/signature-claim-compensation.pdf)\n\n\n\nForm to be submitted along with a claim for compensation by an applicant other than the accident victim or the parent of a minor child.\n\n\n\n\n\n\n\n#### [Signature of the Electronic Claim for Compensation (PDF, 187.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/signature-electronic-claim-compensation.pdf)\n\n\n\nForm to be submitted along with a claim for compensation filed electronically by an applicant other than the accident victim or the parent of a minor child.\n\n\n\n\n\n\n\n#### [Training and Work Experience (PDF, 175.7 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/training-work-experience-form.pdf)\n\n\n\nThis form is used to collect information about the training and work experience of the accident victim.\n\n- ### Road Safety\n\n\n\n\n\n\n#### [Declaration of Requirement for Air Bag Deactivation (PDF, 104.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/air-bag-deactivation-declaration.pdf)\n\n\n\nComplete this form if you are in one of the risk groups identified in the Air Bag Deactivation folder.\n\n- ### Persons With a Mobility Impairment\n\n\n\n\n\n\n#### [Accessible Parking Permit Application (PDF, 411.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/disabled-parking-permit-application.pdf)\n\n\n\nComplete this form if you wish to apply for an accessible parking permit for an automobile, or for a motorcycle, moped or scooter.\n\n\n\n\n\n\n\n#### [Accessible Parking Permit Cancellation or Replacement (PDF, 287.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/accessible-parking-permit-cancellation-replacement.pdf)\n\n\n\nForm used by someone who needs to cancel or replace an accessible parking permit.\n\n- ### Administrative\n\n\n\n\n\n\n#### [Authorization for the Disclosure of Personal Information by the Société de l'assurance automobile du Québec (PDF, 288.6 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/personal-information-authorization.pdf)\n\n\n\nComplete this form to authorize us to disclose information about you to a person you designate.\n\n\n\n\n\n\n\n#### [Authorization to Disclose Information by Telephone (PDF, 132.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/authorization-disclose-information-telephone.pdf)\n\n\n\nThis form is used to authorize the SAAQ to contact, by telephone, a person you have designated in order to provide general information concerning your claim file. This authorization excludes medical information.\n\n\n- ### Driver’s Licence\n\n\n\n\n\n\n#### [Authorization for the Disclosure of a Driving Record by the Société de l'assurance automobile du Québec (PDF, 118.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/driver-disclosure-form.pdf)\n\n\n\nUse this form if you are an insurer, employer or vehicle owner and you wish to obtain a copy of a person’s driving record.\n\n\n\n\n\n\n\n#### [Authorization for the Disclosure of a Driving Record by the Société de l'assurance automobile du Québec—With Intermediary (PDF, 132.6 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/driver-disclosure-intermediary-form.pdf)\n\n\n\nUse this form if you are an insurer, employer or vehicle owner and you wish to designate an intermediary to obtain a copy of a person’s driving record on your behalf.\n\n\n\n\n\n\n\n#### [Driver's Licence Validity Check (XLS, 78.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/driver-licence-check-form.xls)\n\n\n\nChecking the validity of more than 5 driver's licences.\n\n\n\n\n\n\n\n#### [Driving Record Search (PDF, 131.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/driving-record-form.pdf)\n\n\n\nComplete this form if you are the representative of a business, organization, municipality, insurance company or government department or body that wishes to obtain a copy of a person’s driving record.\n\n\n\n\n\n\n\n#### [Request for an Attestation - Excerpt from the SAAQ’s records (bodies outside Québec) (PDF, 682.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/attestation-out-quebec-records-request.pdf)\n\n\n\nThis form allows bodies exercising judicial powers outside of Québec to request an attestation confirming a vehicle’s ownership or whether it is authorized for road use, or an individual’s right to drive.\n\n- ### Vehicle Registration\n\n\n\n\n\n\n#### [Application for Exemption from the Prohibition from Putting into Operation, Acquiring, Renting, Leasing or Registering a Road Vehicle – With Removable Licence Plates and Vehicle Driven by a Third Party (PDF, 121.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/property-damage-insurance.pdf)\n\n\n\nComplete this form if you are a vehicle owner or operator whose licence is currently under penalty and you wish to apply for an exemption that would allow you to put into operation (dealer plates), acquire, lease and register one or more vehicles so that they can be operated by a third party in the course of your business’s activities.\n\n\n\n\n\n\n\n#### [Cancellation of the Registration of a Vehicle Licensed or Sold Outside Québec and/or a Driver’s Licence (PDF, 132.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/cancellation-registration-vehicule-licensed-sold-outside-quebec.pdf)\n\n\n\nComplete this form if you wish to cancel the registration of a vehicle licensed or sold outside Québec, or cancel your driver’s licence if you were issued a licence from another jurisdiction.\n\n\n\n\n\n\n\n#### [Proof of Residence (PDF, 206.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/proof-residence-form.pdf)\n\n\n\nThis form is for an individual in business registered under the International Registration Plan (IRP) who resides in Québec and must provide proof of residence in order to complete his or her file.\n\n- ### Traffic Accident\n\n\n\n\n\n\n#### [Attestation of Income by the Employer and Job Description (PDF, 353.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/employer-income-attestation.pdf)\n\n\n\nForm to be filled out by the employer of an accident victim who held full-time or part-time employment at the time of the accident and who is unable to hold that employment or was unable to hold it for more than 7 days after the accident.\n\n\n\n\n\n\n\n#### [Attestation of School Attendance for Students Aged 16 or Older (PDF, 317.1 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/school-attendance-attestation.pdf)\n\n\n\nForm to be filled out by the educational institution of an accident victim age 16 or older who was a student on a full-time basis.\n\n\n\n\n\n\n\n#### [Attestation of School Attendance – Claim for Death Benefits (PDF, 195.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/school-attendance-death-attestation.pdf)\n\n\n\nForm to be filled out by the educational institution of an accident victim age 16 or older who was a full-time student or a dependent age 18 or older who was a full-time student.\n\n\n\n\n\n\n\n#### [Confirmation of an Employment-Assistance Allowance Lost (PDF, 131.7 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/confirmation-employment-assistance-allowance-lost.pdf)\n\n\n\nForm to be filled out by a Québec local employment centre if an accident victim was receiving an employment-assistance allowance at the time of the accident.\n\n\n\n\n\n\n\n#### [Confirmation of Hiring (PDF, 141.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/hiring-confirmation-form.pdf)\n\n\n\nForm to be filled out by the employer of an accident victim who had guaranteed employment that he or she would have held had the accident not occurred.\n\n\n\n\n\n\n\n#### [Job Description (PDF, 156.6 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/job-description.pdf)\n\n\n\nForm to be filled out by the accident victim’s employer to provide a detailed description of the accident victim’s employment and its context. The information provided helps determine whether injuries and limitations prevent the accident victim from holding his or her employment.\n\n\n\n\n\n\n\n#### [Request for Additional Information Following an Accident (PDF, 134.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/accident-additional-information-request.pdf)\n\n\n\nComplete this form if you are an insurer and wish to obtain additional information about an accident.\n\n- ### Transportation of Goods\n\n\n\n\n\n\n#### [Application for Exemption from the Prohibition from Putting into Operation, Acquiring, Renting, Leasing or Registering a Road Vehicle – With Removable Licence Plates and Vehicle Driven by a Third Party (PDF, 121.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/property-damage-insurance.pdf)\n\n\n\nComplete this form if you are a vehicle owner or operator whose licence is currently under penalty and you wish to apply for an exemption that would allow you to put into operation (dealer plates), acquire, lease and register one or more vehicles so that they can be operated by a third party in the course of your business’s activities.\n\n\n\n\n\n\n\n#### [Application to Have a Conduct Record Adjusted – Heavy Vehicle Owners, Operators or Drivers (PDF, 137.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/application-conduct-record-adjusted-hvood.pdf)\n\n\n\nThis form is for any heavy vehicle owners, operators or drivers who wish to apply to have an adjustment made to their conduct record.\n\n\n\n\n\n\n\n#### [Authorization for the Disclosure of a Heavy Vehicle Owner's and Operator's Record by the Société de l'assurance automobile du Québec (PDF, 185.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/record-disclosure-authorization.pdf)\n\n\n\nComplete this form if you are the representative of a business or organization that wishes to obtain a copy of a heavy vehicle owner or operator’s driving record.\n\n\n\n\n\n\n\n#### [Notice of Non-Liability an Accident (PDF, 163.4 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/notice-non-liability-accident.pdf)\n\n\n\nComplete this form if you are a heavy vehicle operator and you wish to request that liability for an accident be withdrawn from your or the driver’s conduct record.\n\n- ### Transportation of Passengers\n\n\n\n\n\n\n#### [Application for Exemption from the Prohibition from Putting into Operation, Acquiring, Renting, Leasing or Registering a Road Vehicle – With Removable Licence Plates and Vehicle Driven by a Third Party (PDF, 121.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/property-damage-insurance.pdf)\n\n\n\nComplete this form if you are a vehicle owner or operator whose licence is currently under penalty and you wish to apply for an exemption that would allow you to put into operation (dealer plates), acquire, lease and register one or more vehicles so that they can be operated by a third party in the course of your business’s activities.\n\n\n\n\n\n\n\n#### [Application to Have a Conduct Record Adjusted – Heavy Vehicle Owners, Operators or Drivers (PDF, 137.9 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/application-conduct-record-adjusted-hvood.pdf)\n\n\n\nThis form is for any heavy vehicle owners, operators or drivers who wish to apply to have an adjustment made to their conduct record.\n\n\n\n\n\n\n\n#### [Authorization for the Disclosure of a Heavy Vehicle Owner's and Operator's Record by the Société de l'assurance automobile du Québec (PDF, 185.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/record-disclosure-authorization.pdf)\n\n\n\nComplete this form if you are the representative of a business or organization that wishes to obtain a copy of a heavy vehicle owner or operator’s driving record.\n\n\n\n\n\n\n\n#### [Declaration of Modifications Made to an Authorized Vehicle Used to Provide Remunerated Passenger Transportation (PDF, 121.6 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/declaration-modifications-vehicule-remunerated-passenger-transportation.pdf)\n\n\n\nDeclaration of Modifications Made to an Authorized Vehicle Used to Provide Remunerated Passenger Transportation\n\n\n\n\n\n\n\n#### [Notice of Non-Liability an Accident (PDF, 163.4 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/notice-non-liability-accident.pdf)\n\n\n\nComplete this form if you are a heavy vehicle operator and you wish to request that liability for an accident be withdrawn from your or the driver’s conduct record.\n\n\n\n\n\n\n\n#### [Request for a Criminal Record Check – Authorized Driver’s Permit or Registration with a Transportation System Operator (PDF, 171.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/request-for-criminal-record-check.pdf)\n\n\n\nThis form is intended for individuals requesting a criminal record check for the purpose of obtaining or renewing an authorized driver's permit or their registration with a transportation system operator.\n\n- ### Administrative\n\n\n\n\n\n\n#### [Request for Additional Information Following an Accident (PDF, 134.8 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/accident-additional-information-request.pdf)\n\n\n\nComplete this form if you are an insurer and wish to obtain additional information about an accident.\n\n\n\n\n\n\n\n#### [Request for an Attestation - Excerpt from the SAAQ’s records (bodies outside Québec) (PDF, 682.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/attestation-out-quebec-records-request.pdf)\n\n\n\nThis form allows bodies exercising judicial powers outside of Québec to request an attestation confirming a vehicle’s ownership or whether it is authorized for road use, or an individual’s right to drive.\n\n\n\n\n\n\n\n#### [Request for Information - In accordance with section 610 of the highway Safety Code (PDF, 128.4 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/request-information-vehicle-history.pdf)\n\n\n\nComplete this form if you are an insurer or an investigator and you wish to obtain the ownership history of a vehicle for the purposes of a road vehicle theft or fraud investigation. You can also use this form if you are a creditor and you wish to obtain the name and last known address of a vehicle’s owner for the purposes of an ownership claim.\n\n- ### Persons With a Mobility Impairment\n\n\n\n\n\n\n#### [Request for Analysis – Authorized Driver’s Permit or Registration with a Transportation System Operator (PDF, 251.5 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/request-analysis-authorized-driver-permit.pdf)\n\n\n\nThis form is intended for individuals requesting a criminal record check for the purpose of obtaining or renewing an authorized driver's permit or their registration with a transportation system operator.\n\n\n## Safety first, on the road and online\n\nWe are committed to protecting your personal information and privacy. That’s why, when we collect data, we follow a [Policy on Privacy](https://saaq.gouv.qc.ca/en/policies/privacy) that is responsible and transparent. By continuing to browse without modifying your preferences, you accept the use of cookies.\n\nEdit settingsAcceptReject\n\nDétection du zoom", "metadata": {"title": "SAAQ Forms for Individuals, Businesses and Organizations - SAAQ", "description": "Here are all the forms that you will need to deal with the SAAQ. ", "url": "https://saaq.gouv.qc.ca/en/saaq/documents/forms#accordion-content-262", "language": "en", "keywords": "form, claim for compensation, power of attorney, proxy, consent of person having parental authority,  authorization, request for information, special permit", "robots": null, "og_title": "SAAQ Forms for Individuals, Businesses and Organizations", "og_description": "Here are all the forms that you will need to deal with the SAAQ.", "og_url": "https://saaq.gouv.qc.ca/en/saaq/documents/forms", "og_image": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/og.png", "og_audio": null, "og_determiner": null, "og_locale": null, "og_locale_alternate": null, "og_site_name": "SAAQ", "og_video": null, "favicon": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/favicon.ico", "dc_terms_created": null, "dc_date_created": null, "dc_date": null, "dc_terms_type": null, "dc_type": null, "dc_terms_audience": null, "dc_terms_subject": null, "dc_subject": null, "dc_description": null, "dc_terms_keywords": null, "modified_time": null, "published_time": null, "article_tag": null, "article_section": null, "source_url": "https://saaq.gouv.qc.ca/en/saaq/documents/forms#accordion-content-262", "status_code": 200, "scrape_id": "019be61f-020c-74e6-9e1e-8648bd11fc49", "num_pages": null, "content_type": "text/html; charset=utf-8", "proxy_used": "basic", "timezone": null, "cache_state": "hit", "cached_at": "2026-01-22T14:30:45.559Z", "credits_used": 1, "concurrency_limited": false, "concurrency_queue_duration_ms": null, "error": null, "generator": "TYPO3 CMS", "og:image": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/og.png", "twitter:site": "SAAQ", "twitter:description": "Here are all the forms that you will need to deal with the SAAQ.", "og:url": "https://saaq.gouv.qc.ca/en/saaq/documents/forms", "author": "SAAQ", "og:type": "website", "twitter:title": "SAAQ Forms for Individuals, Businesses and Organizations", "facebook-domain-verification": "1en4okgbj220os0h290a52lpwyie3b", "og:site_name": "SAAQ", "og:title": "SAAQ Forms for Individuals, Businesses and Organizations", "viewport": "width=device-width, initial-scale=1", "twitter:url": "https://saaq.gouv.qc.ca/en/saaq/documents/forms", "dcterms.description": "Here are all the forms that you will need to deal with the SAAQ. ", "twitter:card": "summary", "dcterms.creator": "SAAQ", "og:description": "Here are all the forms that you will need to deal with the SAAQ.", "collected_at": "2026-01-22T14:32:30.293928+00:00", "source_type": "html", "source_file": "/home/andalus/self_study/projects/saaq_qa_assistant/data/raw/html_sources/urls.txt", "source_file_id": "/home/andalus/self"}}
