{"page_content": "![](https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/default-banner.jpg)\n\n# Driving and Off-Duty Time: Operators\n\nHeavy vehicle operators must make sure that drivers comply with the requirements concerning the number of hours of driving and off-duty time and that they fill out their daily log.\n\n## What you should know\n\nThe rules governing driving time, on-duty time and off-duty time allow drivers to have a minimum number of hours of rest before getting back on the road and to abide by the maximum number of hours of driving time.\n\nAbiding by the hours of driving and off-duty time reduces the risk of driver fatigue.\n\nDrivers who are tired pose a higher risk for their own safety and that of other road users.\n\n### Vehicles covered\n\nDrivers must comply with the rules governing driving time and off-duty time if they drive one of the following vehicles:\n\n- a road vehicle with a gross vehicle weight rating (GVWR) of 4,500 kg or more:\n  - trucks\n  - road tractors\n  - equipment transport vehicles (e.g. a crane mounted on a truck chassis)\n- combinations of road vehicles consisting of at least one vehicle with a gross vehicle weight rating of 4,500 kg or more\n- tow trucks\n- vehicles transporting dangerous substances requiring the display of safety marks\n\n#### Buses and minibuses\n\nDrivers of buses or minibuses (other than those used for urban transit) must abide by the rules governing driving time and off-duty time, as thoses vehicles are considered heavy vehicles.\n\n### Exempted vehicles\n\nDrivers and operators of the following heavy vehicles are exempted from the regulatory requirements governing hours of driving and off-duty time.\n\n#### Heavy vehicles used for personal purposes\n\nA heavy vehicle used for an entire day by an individual for personal purposes (other than commercial or professional ones). Examples:\n\n- a vehicle weighing 4,500 kg or more (pickup truck, recreational vehicle) that is used solely for personal purposes\n- a vehicle weighing 4,500 or more used for personal purposes for an entire day on Saturdays and Sundays (will be exempted on those days only)\n\nA heavy vehicle used during part of the day by an individual for personal purposes (other than commercial or professional ones) is exempted for the first 75 kilometres travelled in a day, where the following conditions have been met:\n\n- the vehicle has been unloaded and trailers have been unhitched\n- the driver has recorded in the daily log the odometer reading at the beginning and at the end of the use of the vehicle that is used for personal purposes\n- the driver is not the subject of an out-of-service order\n\nFor instance, in the case of a driver who leaves the home terminal (establishment) at the wheel of a road tractor to return home, this driving time is considered to be off-duty for the first 75 kilometres travelled.\n\nIf the distance exceeds 75 kilometres, the time to cover this additional distance will be deemed driving hours.\n\n#### Emergency vehicles\n\nExamples of emergency vehicles:\n\n- ambulance\n- fire department road vehicle\n- response vehicle\n\n#### A heavy vehicle used when required by an emergency service or in the event of a disaster\n\n#### Tool vehicle\n\nA road vehicle, other than a vehicle mounted on a truck chassis, manufactured to perform work, the work station of which is an integral part of the driver’s cab. Examples of tool vehicles:\n\n- grader\n- road roller\n- fork lift\n- back loader\n\n#### Farm tractor and farm machinery\n\nThe farm tractor and farm machinery may be owned by:\n\n- a farmer\n- a person other than a farmer who uses these vehicles solely for personal purposes\n\n#### Farm trailer\n\nThe farm trailer must be owned by a farmer.\n\n#### Bus or minibus used for urban transit\n\nFor the vehicle to be exempted, urban transit must be provided by a public transit corporation or under a contract with a public transit body, an inter-municipal commission or board, a municipality or group of municipalities.\n\n#### Combination of road vehicles where each vehicle has a GVWR of less than 4,500 kg\n\nThe combination of vehicles is exempted, except for a vehicle combination transporting dangerous substances requiring the display of safety marks.\n\n#### Vehicle with a GVWR of less than 4,500 kg transporting dangerous substances\n\nTo be exempted, the vehicle must not require the display of safety marks, and cannot be a minibus or a tow truck.\n\n#### Straight-body truck with 2 or 3 axles\n\nThe truck must be used to transport the primary products of a farm, forest or fishery, if the operator of the truck is the producer of the products. For example, this person could be a potato grower who makes deliveries.\n\nThis exemption also applies to a vehicle that is used to return to a producer’s place of business; in which case the vehicle must be unladen or must only be carrying goods that go into operating the farm, forest or fishery.\n\n### Rules to obey\n\nWhen planning a schedule, a driver must comply with several requirements.\n\n#### 14 previous days\n\nA driver must have taken at least 24 hours of off-duty time during the preceding 14 days.\n\n#### Cycles\n\nA driver may choose to calculate his or her hours of driving and off-duty time based on a cycle of:\n\n- 7 consecutive days (called cycle 1)\n- 14 consecutive days (called cycle 2) Driving prohibition based on cycle\n\n##### Driving prohibition based on cycle\n\n| Cycle 1 (7 days) | Cycle 2 (14 days) |\n| --- | --- |\n| No driving is allowed after the driver has accumulated 70 hours of on-duty time over a period of 7 consecutive days. | No driving is allowed after the driver has accumulated:<br>- 120 hours of on-duty time over a period of 14 consecutive days<br>- OR<br>- 70 hours of on-duty time without having taken at least 24 consecutive hours of off-duty time |\n\n##### Changing a cycle or reset to zero\n\nTo reset a current cycle, to begin a new one or to switch cycles, the driver must take:\n\n- at least 36 consecutive hours of off-duty time if he or she is following cycle 1\n- at least 72 consecutive hours of off-duty time if he or she is following cycle 2\n\nAfter having taken this off-duty time, the driver begins a new cycle. The cycle is therefore reset to zero and the hours of on-duty time begin to accumulate again.\n\n#### Work shift\n\nA work shift is the time between 2 periods of at least 8 consecutive hours of off-duty time.\n\n**No driving is allowed if…**\n\n- 13 **hours of driving time** have accumulated since the end of the most recent period of 8 consecutive hours of off-duty time\n- 14 **hours of on-duty time** have accumulated since the end of the most recent period of 8 consecutive hours of off-duty time\n- 16 **hours** have elapsed since the end of the most recent period of 8 consecutive hours of off-duty time\n\n#### Day\n\nA day is a period of 24 hours that begins at the time designated by the operator.\n\n| Daily requirements | No driving is allowed after… |\n| --- | --- |\n| A driver must take at least 10 hours of off-duty time in a day as follows:<br>- At least 2 of these 10 hours are not part of the required 8 consecutive hours of off-duty time.<br>- These 2 hours may be split up into breaks of not less than 30 minutes. | - 13 hours of driving have accumulated<br>- 14 hours of on-duty time have accumulated |\n\n#### Special situations\n\nConsult the publication entitled [Driving and Off-Duty Time for Heavy Vehicle Drivers (PDF, 2.1 MB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/driving-off-duty-heavy-vehicle.pdf) to learn about the rules to follow in the event of:\n\n- daily hours of off-duty time are deferred\n- the splitting of daily hours of off-duty time in a sleeper berth\n- an emergency situation\n- poor driving conditions\n- travel on a ferry\n- troubleshooting\n- winter road maintenance\n\n## Daily log\n\nA driver must fill out a daily log listing all hours of driving, on-duty time other than driving, and off-duty time.\n\nThe starting time of the log is also the beginning of the day.\n\nDrivers who meet all of the following conditions are not required to fill out a daily log:\n\n- they operate within a 160 km radius of their home terminal\n- they return to their home terminal each day to take at least 8 hours of off-duty time\n- the vehicle they are driving is not covered by a permit for exemption from the hours of driving and off-duty time\n- the operator fills out registers (detailed or short)\n\n### Keeping the daily log and other documents\n\nIf the driver fills out a daily log, the following documents must be kept in the vehicle:\n\n- a copy of the daily logs from the 14 previous days\n- the daily log for the current day, completed up to the time of the last change of duty status\n- documents related to the trip, for example, fuel receipts, bills of lading and delivery receipts.\n\nDrivers are required to sumbit the daily logs and trip-related documents to their operator. They **have up to 20 days** after their return to do so.\n\nOperators are required to keep the daily logs for 6 months after the dated indicated by the driver on each log.\n\nLast update: May 17, 2022\n\n- ## Publications\n\n  - [Driving and Off-Duty Time for Heavy Vehicle Drivers – Fact Sheet (PDF, 1.4 MB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/driving-off-duty-heavy-checklist.pdf)\n  - [Driving and Off-Duty Time for Heavy Vehicle Drivers – Guide (PDF, 2.1 MB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/driving-off-duty-heavy-vehicle.pdf)\n  - [Obligations of Heavy Vehicles Users (PDF, 5.9 MB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/obligations-heavy-vehicles-users.pdf)\n  - Conduct Review Policy for Heavy Vehicle Owners and Operators\n  - Information Bulletin for Heavy Vehicle Drivers, Owners and Operators – Electronic On-Board Recorders: A Growing Trend\n- ## See also\n\n  - [Driver Fatigue](https://saaq.gouv.qc.ca/en/transportation-goods/heavy-vehicle-driver-fatigue)\n  - [Electronic Logging Devices (ELDs)](https://saaq.gouv.qc.ca/en/transportation-goods/eld)\n- ## Laws and regulations\n\n  - [Highway Safety Code⁠ ⁠](http://legisquebec.gouv.qc.ca/en/showdoc/cs/C-24.2)\n  - [Regulation respecting the hours of driving and rest of heavy vehicle drivers⁠ ⁠](http://legisquebec.gouv.qc.ca/en/showdoc/cr/C-24.2,%20r.%2028)\n\n## Safety first, on the road and online\n\nWe are committed to protecting your personal information and privacy. That’s why, when we collect data, we follow a [Policy on Privacy](https://saaq.gouv.qc.ca/en/policies/privacy) that is responsible and transparent. By continuing to browse without modifying your preferences, you accept the use of cookies.\n\nEdit settingsAcceptReject\n\nDétection du zoom", "metadata": {"title": "Driving and Off-Duty Time: Operators - SAAQ", "description": "Heavy vehicle operators must make sure that drivers comply with the requirements concerning the number of hours of driving and off-duty time and that they fill out their daily log.", "url": "https://saaq.gouv.qc.ca/en/transportation-goods/driving-off-duty-time-owners-operators", "language": "en", "keywords": "heavy vehicle, heavy truck, hvoo, operator, driving, rest, off-duty time, daily log, hour, trucker", "robots": null, "og_title": "Driving and Off-Duty Time", "og_description": "Heavy vehicle operators must make sure that drivers comply with the requirements concerning the number of hours of driving and off-duty time and that they fill out their daily log.", "og_url": "https://saaq.gouv.qc.ca/en/transportation-goods/driving-off-duty-time-owners-operators", "og_image": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/og.png", "og_audio": null, "og_determiner": null, "og_locale": null, "og_locale_alternate": null, "og_site_name": "SAAQ", "og_video": null, "favicon": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/favicon.ico", "dc_terms_created": null, "dc_date_created": null, "dc_date": null, "dc_terms_type": null, "dc_type": null, "dc_terms_audience": null, "dc_terms_subject": null, "dc_subject": null, "dc_description": null, "dc_terms_keywords": null, "modified_time": null, "published_time": null, "article_tag": null, "article_section": null, "source_url": "https://saaq.gouv.qc.ca/en/transportation-goods/driving-off-duty-time-owners-operators", "status_code": 200, "scrape_id": "019be623-b9b3-724c-8b6a-2ab54d0b16df", "num_pages": null, "content_type": "text/html; charset=utf-8", "proxy_used": "stealth", "timezone": "America/New_York", "cache_state": null, "cached_at": null, "credits_used": 5, "concurrency_limited": false, "concurrency_queue_duration_ms": null, "error": null, "twitter:card": "summary", "twitter:description": "Heavy vehicle operators must make sure that drivers comply with the requirements concerning the number of hours of driving and off-duty time and that they fill out their daily log.", "og:url": "https://saaq.gouv.qc.ca/en/transportation-goods/driving-off-duty-time-owners-operators", "og:description": "Heavy vehicle operators must make sure that drivers comply with the requirements concerning the number of hours of driving and off-duty time and that they fill out their daily log.", "viewport": "width=device-width, initial-scale=1", "og:title": "Driving and Off-Duty Time", "facebook-domain-verification": "1en4okgbj220os0h290a52lpwyie3b", "twitter:title": "Driving and Off-Duty Time", "twitter:url": "https://saaq.gouv.qc.ca/en/transportation-goods/driving-off-duty-time-owners-operators", "og:type": "website", "og:image": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/og.png", "og:site_name": "SAAQ", "twitter:site": "SAAQ", "generator": "TYPO3 CMS", "dcterms.creator": "SAAQ", "author": "SAAQ", "dcterms.description": "Heavy vehicle operators must make sure that drivers comply with the requirements concerning the number of hours of driving and off-duty time and that they fill out their daily log.", "indexId": "3b55956b-ddf5-44bd-8823-d156a7df05e0", "collected_at": "2026-01-22T14:37:38.862109+00:00", "source_type": "html", "source_file": "/home/andalus/self_study/projects/saaq_qa_assistant/data/raw/html_sources/urls.txt", "source_file_id": "/home/andalus/self"}}
