{"page_content": "![](https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/default-banner.jpg)\n\n# Electronic Logging Devices (ELDs)\n\nBarring certain exceptions, effective April 30, 2023, the [Regulation respecting the hours of driving and rest of heavy vehicle drivers⁠ ⁠](https://www.publicationsduquebec.gouv.qc.ca/fileadmin/gazette/pdf_encrypte/lois_reglements/2023A/106112.pdf) (the Regulation) now requires that heavy vehicle drivers use a record of duty status to keep track of their on-duty time, hours of driving and off-duty time. Furthermore, most heavy vehicle drivers will now have to use an electronic logging device (ELD) to produce their records of duty status.\n\nUsing an ELD has many advantages. As hours of driving are logged automatically, the device makes it easier to follow the requirements of the Regulation and thereby helps prevent fatigue at the wheel. In addition, drivers save time as they are not required to fill out their records of duty status by hand.\n\n## Regulatory framework\n\nIn June 2019, Transport Canada published the [Regulation Amending the Commercial Vehicle Drivers Hours of Service Regulations⁠ ⁠](https://canadagazette.gc.ca/rp-pr/p2/2019/2019-06-12/html/sor-dors165-eng.html), which came into effect on January 1, 2023. In keeping with the other Canadian provinces and territories, Québec has harmonized its legislation with that of the federal government.\n\nRefer to the “Frequently Asked Questions” section below to find out more about ELDs and these legislative amendments.\n\n## Frequently Asked Questions\n\n## What is an electronic logging device (ELD)?\n\nAn electronic logging device (ELD) is a device connected to a vehicle’s motor, which automatically records all information related to a heavy vehicle driver’s hours of driving.\n\n## Have any changes been made regarding how long records of duty status must be kept?\n\nNo. Regardless of the medium used (paper or electronic records), drivers who are required to produce a record of duty status must always keep their records of duty status for the previous 14 days on board their vehicle. Operators must keep the records of duty status in the driver’s file for a minimum of 6 months.\n\n## Is there certification for this type of device?\n\nHeavy vehicles subject to the ELD requirement must be equipped with a certified ELD that meets Canada’s technical specifications regarding ELDs.\n\nSee the [list of certified ELDs⁠ ⁠](https://tc.canada.ca/en/road-transportation/electronic-logging-devices/list-certified-electronic-logging-devices).\n\n### Obligations\n\n## Are ELDs mandatory in Québec?\n\nELDs have been mandatory in Québec since April 30, 2023, which is the date the amendments to the _Regulation to amend the regulation respecting the hours of driving and rest of heavy vehicle drivers_ came into effect. This requirement applies to all heavy vehicles travelling on Québec roads, regardless of whether or not those vehicles are registered in Québec.\n\n## Are heavy vehicles providing extra-provincial transportation services required to be equipped with an ELD when travelling in Québec?\n\nEffective April 30, 2023, heavy vehicles used in extra-provincial transportation are also required to be equipped with an ELD when travelling in Québec.\n\n## Are ELDs mandatory for heavy vehicles travelling outside Québec?\n\nIt is your responsibility to verify the requirements regarding ELDs in each jurisdiction in which you plan to travel.\n\n## Which vehicles must be equipped with an ELD?\n\nGenerally speaking, any heavy vehicle subject to the Regulation and whose driver is required to keep track of hours of driving, on-duty time and off-duty time in a record of duty status must be equipped with an ELD. The following exceptions apply:\n\n- vehicles manufactured before the 2000 model year\n- vehicles that are leased under a rental agreement of not longer than 30 days, provided the agreement has been neither extended nor renewed\n- vehicles that are being driven within a 160 km radius of the driver’s home terminal, provided the driver also returns to the home terminal each day to begin a minimum of 8 consecutive hours of rest\n- situations where a driver operating a vehicle within a 160 km radius of the home terminal is unable to return to the home terminal the same day due to adverse driving conditions\n- vehicles driven under the following circumstances:\n  - the vehicles are neither hitched nor loaded, except if the saddle-mount method is being used to transport one or more other vehicles that are also part of the delivery, and the vehicles are being delivered:\n    - to the owner’s home terminal following a transfer of ownership\n    - to the lessee\n    - to the vehicles are neither hitched nor loaded and are being driven within the first 5 days of their delivery following a transfer of ownershipthe lessor during or upon the expiry of the rental agreement\n    - to a branch of a vehicle rental company for an inventory adjustment\n  - the vehicles are neither hitched nor loaded and are being driven within the first 5 days of their delivery following a transfer of ownership\n- new vehicles that are being driven in order to be delivered to a company to complete their manufacturing or make them comply with the use for which they are essentially intended, or that are being returned to the owner following such an operation\n\n## Can drivers of a heavy vehicle that is not required to be equipped with an ELD use any electronic device to record their on-duty and off-duty time?\n\nHeavy vehicle drivers who are in this situation can use any device they wish to record their on-duty and off-duty time. They can use a certified ELD, an ELD that has not been certified, a computer or any other device, provided the device in question can produce and submit a valid record of duty status in accordance with the Regulation. Drivers may also choose to complete their records of duty status on paper.\n\n## Can drivers of a heavy vehicle that is not required to be equipped with a certified ELD use an ELD anyway to record their on-duty and off-duty time?\n\nFor practical or financial reasons, operators may decide to install a certified ELD on a heavy vehicle even if not required to do so, just as a driver may decide to use an ELD for similar reasons. The only thing that may prevent them from doing so would be an incompatibility between the ELD and certain types of motors.\n\n## Where can I find information regarding Canada’s technical specifications with regard to ELDs?\n\nVisit the website of the [Canadian Council of Motor Transport Administrators⁠ ⁠](https://ccmta.ca/en/national-safety-code/canadian-eld-standard).\n\n## Where can I view the current requirements of the Regulation respecting the hours of driving and rest of heavy vehicle drivers?\n\nSee the page entitled [Driving and Off-Duty Time](https://saaq.gouv.qc.ca/en/transportation-goods/driving-and-off-duty-time-driver).\n\n## How can I stay informed about the latest developments regarding ELDs?\n\nSubscribe to the [Le Relayeur](https://saaq.gouv.qc.ca/en/transportation-goods/le-relayeur) newsletter (in French only).\n\nTo reach the dedicated line for heavy vehicle owners, operators and drivers, call [1-800-554-4814](tel:180055448140).\n\nLast update: September  3, 2024\n\n- ## See also\n\n\n[Driving and Off-Duty Time](https://saaq.gouv.qc.ca/en/transportation-goods/driving-and-off-duty-time-driver)\n\n- ## Other websites\n\n  - [Technical Standard for Electronic Logging Devices⁠ ⁠](https://ccmta.ca/en/national-safety-code/canadian-eld-standard)\n  - [List of Certified ELDs⁠ ⁠](https://tc.canada.ca/en/road-transportation/electronic-logging-devices/list-certified-electronic-logging-devices)\n- ## Laws and regulations\n\n  - [Regulation respecting the hours of driving and rest of heavy vehicle drivers⁠ ⁠](https://www.publicationsduquebec.gouv.qc.ca/fileadmin/gazette/pdf_encrypte/lois_reglements/2023A/106112.pdf)\n  - [Regulations Amending the Commercial Vehicle Drivers Hours of Service Regulations⁠ ⁠](https://canadagazette.gc.ca/rp-pr/p2/2019/2019-06-12/html/sor-dors165-eng.html)\n\n## Safety first, on the road and online\n\nWe are committed to protecting your personal information and privacy. That’s why, when we collect data, we follow a [Policy on Privacy](https://saaq.gouv.qc.ca/en/policies/privacy) that is responsible and transparent. By continuing to browse without modifying your preferences, you accept the use of cookies.\n\nEdit settingsAcceptReject\n\nDétection du zoom", "metadata": {"title": "Electronic Logging Devices (ELDs) - SAAQ", "description": "Answers to questions regarding electronic logging devices (ELDs).", "url": "https://saaq.gouv.qc.ca/en/transportation-goods/eld", "language": "en", "keywords": "Electronic, Logging, Device, ELD, daily log, hours, driving, rest, Transport Canada", "robots": null, "og_title": "Electronic Logging Devices (ELDs)", "og_description": "Answers to questions regarding electronic logging devices (ELDs).", "og_url": "https://saaq.gouv.qc.ca/en/transportation-goods/eld", "og_image": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/og.png", "og_audio": null, "og_determiner": null, "og_locale": null, "og_locale_alternate": null, "og_site_name": "SAAQ", "og_video": null, "favicon": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/favicon.ico", "dc_terms_created": null, "dc_date_created": null, "dc_date": null, "dc_terms_type": null, "dc_type": null, "dc_terms_audience": null, "dc_terms_subject": null, "dc_subject": null, "dc_description": null, "dc_terms_keywords": null, "modified_time": null, "published_time": null, "article_tag": null, "article_section": null, "source_url": "https://saaq.gouv.qc.ca/en/transportation-goods/eld", "status_code": 200, "scrape_id": "019be623-a1ac-771b-a282-54dcc5581041", "num_pages": null, "content_type": "text/html; charset=utf-8", "proxy_used": "basic", "timezone": null, "cache_state": "hit", "cached_at": "2026-01-22T14:33:57.420Z", "credits_used": 1, "concurrency_limited": false, "concurrency_queue_duration_ms": null, "error": null, "facebook-domain-verification": "1en4okgbj220os0h290a52lpwyie3b", "dcterms.creator": "SAAQ", "og:title": "Electronic Logging Devices (ELDs)", "og:description": "Answers to questions regarding electronic logging devices (ELDs).", "generator": "TYPO3 CMS", "twitter:card": "summary", "og:image": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/og.png", "viewport": "width=device-width, initial-scale=1", "og:type": "", "og:site_name": "SAAQ", "twitter:site": "SAAQ", "twitter:title": "Electronic Logging Devices (ELDs)", "og:url": "https://saaq.gouv.qc.ca/en/transportation-goods/eld", "dcterms.description": "Answers to questions regarding electronic logging devices (ELDs).", "author": "SAAQ", "twitter:description": "Answers to questions regarding electronic logging devices (ELDs).", "twitter:url": "https://saaq.gouv.qc.ca/en/transportation-goods/eld", "collected_at": "2026-01-22T14:37:33.300192+00:00", "source_type": "html", "source_file": "/home/andalus/self_study/projects/saaq_qa_assistant/data/raw/html_sources/urls.txt", "source_file_id": "/home/andalus/self"}}
