{"page_content": "![](https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/default-banner.jpg)\n\nRegistering a Vehicle\n\n# Transferring a Vehicle Between Individuals\n\nIf you are about to buy or sell a used vehicle, complete the transfer with a few clicks via [SAAQclic⁠ ⁠](https://saaqclic.saaq.gouv.qc.ca/saaqstorefront/en/login). To be eligible for an online transfer, make sure the following requirements are met:\n\n- The vehicle must be categorized as a “passenger vehicle”.\n- It must be less than 25 years old.\n- It must be registered under only one name.\n- You must have no unpaid fines on file.\n\nTo find out how to complete the transfer using SAAQclic, watch these how-to videos and read the [Fact Sheet – Transferring a Vehicle Between Individuals on SAAQclic (PDF, 161.8 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/transferring-vehicle-between-individuals.pdf).​​​​​​​\n\n### How-to videos\n\nThis video shows how to transfer a passenger vehicle between individuals using SAAQclic.\n\nBy clicking on the video, you will change the context of this page.\n\nPlay\n\nPlay\n\n00:00\n\nRewindForward00:00\n\n00:00\n\nMute\n\nTurn down volume\n\nTurn up volume\n\nToggle fullscreen mode\n\nThis video shows how to accept a vehicle transfer and register the vehicle using SAAQclic.\n\nBy clicking on the video, you will change the context of this page.\n\nPlay\n\nPlay\n\n00:00\n\nRewindForward00:00\n\n00:00\n\nMute\n\nTurn down volume\n\nTurn up volume\n\nToggle fullscreen mode\n\nRead carefully the following step-by-step instructions on how to register a vehicle through SAAQclic or at an SAAQ service outlet.\n\n## Before transferring and registering the vehicle\n\n### The vehicle must be categorized as a “passenger vehicle”\n\nVehicles categorized as passenger vehicles include:\n\n- automobiles with a net weight of 3,000 kg or less\n- motor homes with a net weight of 3,000 kg or less\n- sport utility vehicles (SUVs)\n- minivans\n- pick-up trucks used for personal purposes that have two axles and a net weight of more than 3,000 kg but less than 4,000 kg\n- military-type vehicles, provided:\n  - they have the same configuration as road vehicles intended for use on public roads\n  - they have the equipment required to be compliant for road use\n  - they are equipped with tires and not tracks\n  - they have undergone an [inspection (PDF, 115.7 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/declaration-ingenieur.pdf) (form in French only) by an engineer who is a member of the Ordre des ingénieurs du Québec (this inspection is not required for [vehicles registered for restricted use](https://saaq.gouv.qc.ca/en/vehicle-registration/registering-vehicle/vehicle-with-restricted-area-use/other-vehicles-with-restricted-area-use))\n  - after having received a favourable report from an engineer, they have undergone a mechanical inspection and been declared compliant.\n\n### The vehicle cannot be registered…\n\nIf the buyer or the seller has an unpaid fine for an offence under the _Highway Safety Code_ or under a municipal traffic or parking bylaw.\n\nThe Bureau des infractions et amendes and municipal courts are responsible for collecting fines. You cannot pay a fine at an SAAQ service outlet.\n\nTo check whether the vehicle can be registered, you can use [SAAQclic⁠ ⁠](https://saaqclic.saaq.gouv.qc.ca/saaqstorefront/en/login). You can also use our automated telephone services by calling 1-800-361-7620 (choose option 4, then option 5, then option 4 again).\n\n### The vehicle cannot be registered through SAAQclic in the following cases:\n\n- donated vehicle\n- inherited vehicle\n- power of attorney\n- mandate in case of incapacity\n- vehicle won through a lottery\n- vehicle purchased through a judicial sale\n- divorce judgment, dissolution of a civil union or separation of de facto spouses\n- vehicle reported stolen\n- vehicle of interest\n- discarded vehicle\n- seized vehicle\n- vehicle licensed or sold outside Québec\n- irreparable vehicle\n- motorcycle, moped or scooter, minibus, recreational vehicle, trailer, truck\n- co-owned vehicle where no registrant has been designated. In this case, the transfer of ownership can only be carried out at a service outlet. For more information, see the paragraph “If the vehicle is sold by co-owners” below\n- the residential addresses indicated in the files of the buyer and seller are outside Québec\n\n### To avoid unpleasant surprises\n\nBefore buying a used vehicle, check the [Registre des droits personnels et réels mobiliers⁠ ⁠](https://www.rdprm.gouv.qc.ca/en/pages/english.html) (register of personal and movable real rights—in French only) to make sure it is free of debt. If you buy a vehicle that has not been paid for in full, it can be seized by the creditor.\n\nYou can also request the vehicle's ownership history from the SAAQ to find out:\n\n- if it has been rebuilt\n- if it has undergone a mechanical inspection\n- how many people have owned it\n- how it has been used in the past, e.g. if it was used as a taxi before October 10, 2020\n\nTo obtain the vehicle's ownership history, you can:\n\n- use the online service available via [SAAQclic⁠ ⁠](https://saaqclic.saaq.gouv.qc.ca/saaqstorefront/en/login)\n- go to one of our [service outlets](https://saaq.gouv.qc.ca/en/find-service-outlet)\n\n[Fees](https://saaq.gouv.qc.ca/en/saaq/rates-fines/fees-other-services) apply.\n\n#### Make sure the vehicle has not been damaged by flooding.\n\nWhile flood-damaged vehicles are usually declared “irreparable” and dismantled for certain parts to be recycled, some flood-damaged vehicles may slip through the cracks and end up on the market.\n\nBe sure to verify before buying a vehicle.\n\nFor more information, refer to the [Flood-Damaged Road Vehicles](https://saaq.gouv.qc.ca/en/road-safety/flood-damaged-road-vehicles) page.\n\n### If the Vehicle Is Prohibited From Being Put Into Operation or Has Been Stored for One Year or Longer\n\nIt cannot be put back into operation until it has undergone a [mechanical inspection](https://saaq.gouv.qc.ca/en/vehicle-registration/vehicle-mechanical-inspection) carried out by a road vehicle inspection agent authorized by the SAAQ and a mechanical inspection certificate has been issued confirming that the vehicle meets the applicable standards.\n\nWhen acquiring a vehicle that has been in storage, the date as of which a mechanical inspection becomes required is based on the date the former owner put the vehicle into storage.\n\n### If the vehicle is sold by co-owners\n\nIf the vehicle is owned by more than one person (co-ownership), a registrant must be designated. The vehicle will appear in the registrant’s file, enabling the registrant to transfer the vehicle via SAAQclic. Otherwise, all sellers whose names currently appear and all buyers whose names will appear on the registration certificate must go to a service outlet to register the vehicle.\n\nA registrant can be designated by filling out the [Designating a Registrant (Co-Owned Vehicles)](https://saaq.gouv.qc.ca/en/vehicle-registration/co-owned-vehicle) form or by going to a service outlet.\n\n### If the vehicle is jointly purchased\n\nThe SAAQ recommends only having one name appear on the registration certificate. However, if the buyers want to have all their names on the certificate, they must designate a registrant. For more information, see our [Fact Sheet – Registering a Co-Owned Vehicle. (PDF, 137.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/registering-co-owned-vehicle-fact-sheet.pdf)\n\n## Transferring and registering the vehicle\n\n### Online\n\nThe vehicle can be transferred and registered online through [SAAQclic⁠ ⁠](https://saaqclic.saaq.gouv.qc.ca/saaqstorefront/en/login) when the following conditions are met:\n\n**The seller must** **:**\n\n- be the owner of the vehicle or the registrant if the vehicle is owned by more than one person\n- be aged 18 or older\n\n**The buyer must:**\n\n- be aged 18 or older\n\n**The seller and buyer must:**\n\n- carry out the transfer using their respective SAAQclic accounts, and, therefore, have each created their own SAAQclic account\n- have the right to sell and buy a vehicle\n- enter or update their banking information in the My Financial File section of SAAQclic\n\n**The vehicle must:**\n\n- be registered in Québec\n- be less than 25 years old\n- be classified as a “passenger vehicle”, in other words:\n  - be an automobile, sport utility vehicle or minivan\n  - have a maximum capacity of 9 occupants\n  - be used for personal purposes\n\n**Selling your vehicle?**\n\nStart by identifying the vehicle and entering the identification number found on the buyer’s (registrant’s) driver’s licence. Then enter the sale price. You will also have the option to transfer your licence plate to the buyer. Before starting the transfer, make sure the banking information entered in SAAQclic is accurate. Any applicable reimbursement of the vehicle registration fees will be made by direct deposit within 3 to 5 business days.\n\n**Buying a vehicle?**\n\nSimply access your SAAQclic account, accept the vehicle transfer, and register the vehicle within 48 business hours following the seller’s transfer. Among other things, you will have to enter the vehicle’s odometer reading and add your banking information to your account to pay the QST and any applicable registration fees.\n\nDid you know that you can reuse the licence plate of the purchased vehicle? Keeping the same plate is not only cost-effective and time-saving, but also eco-friendly!\n\nFor more information, see our [Fact Sheet – Transferring a Vehicle Between Individuals on SAAQclic (PDF, 161.8 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/transferring-vehicle-between-individuals.pdf).\n\n### At a service outlet\n\nThe buyer and seller must show their driver's licence or another official photo ID document.\n\nThe buyer must also supply the vehicle's odometer reading.\n\n#### Before Going to an SAAQ Service Outlet\n\nCall [Revenu Québec⁠ ⁠](https://www.revenuquebec.ca/en/contact-us/) to find out which documents are necessary for the calculation of QST in the following cases:\n\n- if the vehicle is 25 years old or older (40 years old or older, in the case of a truck)\n- if the vehicle is a used luxury vehicle less than 25 years old and not listed in the reference guide used by Revenu Québec (luxury vehicles that are not listed: Aston Martin, Bentley, Ferrari, Hummer, Lamborghini, Lotus, Maserati and Rolls Royce)\n- if the vehicle comes from outside Canada\n- if the used vehicle is damaged or has unusual wear\n\n#### If you are under age 18\n\nYou must also present the [Consent of a Person Having Parental Authority (PDF, 128.7 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/parental-authority-form.pdf) form completed by your father, mother or legal guardian.\n\n#### If you do not have a driver's licence\n\n[Phone us](https://saaq.gouv.qc.ca/en/reach-us) to find out what documents you must bring with you when registering your vehicle.\n\n#### If you cannot go in person\n\nThe person who goes to the service outlet for you must bring the original [Power of Attorney (PDF, 657.0 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/power-attorney-form.pdf) form completed by you beforehand.\n\n#### If the vehicle is from outside Québec\n\nA vehicle from outside Québec is considered to be an imported vehicle, which means there are other documents you will have to provide so that we can verify whether the vehicle can be used in Québec. Refer to the [Registering a vehicle from outside Québec](https://saaq.gouv.qc.ca/en/vehicle-registration/vehicle-from-outside-quebec) section for more information.\n\n## Temporary licence plate\n\nIf the licence plate was not transferred along with the vehicle, to legally operate the vehicle, the buyer **must** affix their temporary paper licence plate to the vehicle while waiting to receive their metal licence plate in the mail. The metal plate will be delivered by mail within 10 to 20 business days to the primary address in the buyer’s SAAQ file.\n\nIf the vehicle transfer is carried out at an SAAQ service outlet, the temporary paper licence plate will be issued by the service outlet agent. If the transfer is carried out online via [SAAQclic⁠ ⁠](https://saaqclic.saaq.gouv.qc.ca/saaqstorefront/en/login), the buyer must print the temporary licence plate on standard (8 ½ x 11-inch) white paper as the final step in the online vehicle registration process.\n\nIn either case, the temporary paper licence plate must be affixed to the vehicle’s rear window in the top left corner.\n\n[This video (MP4, 29.8 MB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/images/immatriculation/plaque-provisoire.mp4) shows how.\n\n## Costs and payment\n\n### Registration fees\n\nTo find out the cost to have a vehicle registered, visit the [Rates and Fines section](https://saaq.gouv.qc.ca/en/saaq/rates-fines/vehicle-registration/comparative-tables).\n\n### The vehicle registration fee will be higher if:\n\n- the vehicle is considered a **[**luxury vehicle**](https://saaq.gouv.qc.ca/en/vehicle-registration/additional-registration-fee-luxury-vehicles)**. This is the case when the vehicle meets **all 3 of the following criteria**:\n  - it is worth more than $40,000\n  - it has a net weight of 3,000 kg or less\n  - it is less than 7 years old\n\n\n\n     The additional registration fee equals 1% of the vehicle's value exceeding $40,000.\n\n- the vehicle is considered a [**large-cylinder capacity vehicle**](https://saaq.gouv.qc.ca/en/saaq/rates-fines/vehicle-registration/additional-registration-fee-large-cylinder-capacity-vehicles). This is the case when:\n  - its engine has a cylinder capacity of 3.95 litres or more\n  - the model year is 1995 or later\n\n- you live in an area where public transit is available\n- you live in the Montréal agglomeration\n\n### Payment of the QST\n\nAt the time of registration, you are required to pay the QST, **even in the case of a used vehicle**. The SAAQ collects the QST on the agreed selling price or the estimated value of the vehicle, whichever is greater.\n\nYou do not have to pay the GST because the sale is between individuals.\n\nFor more information on the payment or collection of taxes, call [Revenu Québec⁠ ⁠](https://www.revenuquebec.ca/en/contact-us/).\n\n### Cost and payment\n\n#### Online\n\nYou will have to add a bank account to your online account (using a cheque specimen) to carry out the transaction.\n\n#### At a service outlet\n\nAt our service outlets, we accept payment:\n\n- in cash\n- debit card (not available in some service outlets)\n- by one or more [pre-authorized debits](https://saaq.gouv.qc.ca/en/online-services/citizens/payment-pre-authorized-debits) (a cheque specimen must be provided)\n- by cheque or money order\n\n**Payment by credit card is not accepted.**\n\n## Insurance\n\nYou must have a civil liability insurance policy contracted from a private insurer providing minimum coverage of $50,000.\n\nIf you are not insured and you are pulled over by the police or involved in a traffic accident that causes more than $500 in damage to the property of another party:\n\n- your driver's licence or your right to obtain one could be suspended\n- all of your vehicles may be prohibited from being put into operation\n- you will be fined $325 to $2,800\n\n**The seller remains the owner and person liable for the vehicle until the vehicle is registered in the buyer's name.**\n\nThis means that should the buyer commit an offence or be involved in an accident with a vehicle that is still registered in the seller's name, it is the seller who would be held responsible.\n\nLast update: July 29, 2025\n\n- ## Online services\n\n  - [Checking if a Vehicle Can Be Registered](https://saaq.gouv.qc.ca/en/online-services/citizens/checking-vehicle-registered)\n- ## Costs\n\n  - [Passenger Vehicle](https://saaq.gouv.qc.ca/en/saaq/rates-fines/vehicle-registration/cost-renewal/passenger-vehicles)\n  - [Additional Registration Fee for Large-Cylinder Capacity Vehicles](https://saaq.gouv.qc.ca/en/saaq/rates-fines/vehicle-registration/additional-registration-fee-large-cylinder-capacity-vehicles)\n- ## Find us\n\n  - [Find a Service Outlet](https://saaq.gouv.qc.ca/en/find-service-outlet/?tx_lbopointsdeservice_ajaxpds%5Bsujet%5D=361&cHash=e73e1ee65f183f04497541d9c818d2f3)\n  - [Find a Mechanical Inspection Centre](https://saaq.gouv.qc.ca/en/find-service-outlet/?tx_lbopointsdeservice_ajaxpds%5Bsujet%5D=458&cHash=cf96cfc4331aaad31874dba93d135989)\n- ## Contact us\n\n\n\n\nQuébec area: 418-643-7620\n\nMontréal area: 514-873-7620\n\nElsewhere: 1-800-361-7620 (Québec, Canada, United States)\n\n- ## Forms\n\n  - [Consent of a Person Having Parental Authority (PDF, 128.7 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/parental-authority-form.pdf)\n  - [Vehicle Record Request (PDF, 218.5 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/vehicle-record-request.pdf)\n  - [Power of Attorney (PDF, 657.0 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/power-attorney-form.pdf)\n  - [Déclaration de l'ingénieur (PDF, 115.7 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/formulaires/declaration-ingenieur.pdf) (in French only)\n- ## Publications\n\n  - [Don't Fall for Stories (PDF, 1,015.0 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/dont-fall-stories.pdf)\n  - [Liability Insurance for Property Damage (PDF, 195.1 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/property-damage-liability-insurance.pdf)\n  - [Pay Your Fines to Keep Your Driving and Operating Privileges (PDF, 284.9 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/pay-fines-keep-operating-privileges.pdf)\n  - [Registering a Co-Owned Vehicle Fact Sheet (PDF, 137.2 KB)⁠ ⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/registering-co-owned-vehicle-fact-sheet.pdf)\n  - [Transferring a Vehicule Between Individuals on SAAQclic Fact Sheet (PDF, 161.8 KB)⁠](https://saaq.gouv.qc.ca/blob/saaq/documents/publications/transferring-vehicle-between-individuals.pdf)\n- ## See also\n\n  - [Registering a Vehicle from Outside Québec](https://saaq.gouv.qc.ca/en/vehicle-registration/vehicle-from-outside-quebec)\n  - [Flood-Damaged Road Vehicles](https://saaq.gouv.qc.ca/en/road-safety/flood-damaged-road-vehicles)\n  - [Road Safety - In an Automobile](https://saaq.gouv.qc.ca/en/road-safety/modes-transportation/automobile)\n- ## Other websites\n\n  - [Registre des droits personnels et réels mobiliers⁠ ⁠](https://www.rdprm.gouv.qc.ca/fr/Pages/Accueil.html)(in French only)\n  - [Bureau des infractions et amendes⁠ ⁠](https://www.amendes.qc.ca/RPVVirtuel/Paiement_en_ligne.asp?lang=English)\n- ## Laws and regulations\n\n  - [Highway Safety Code⁠ ⁠](http://legisquebec.gouv.qc.ca/en/showdoc/cs/C-24.2)\n  - [Automobile Insurance Act⁠ ⁠](http://legisquebec.gouv.qc.ca/en/ShowDoc/cs/A-25%22)\n  - [Regulation respecting road vehicle registration⁠ ⁠](http://legisquebec.gouv.qc.ca/en/ShowDoc/cr/C-24.2,%20r.%2029/)\n  - [Regulation respecting safety standards for road vehicles⁠ ⁠](http://legisquebec.gouv.qc.ca/en/ShowDoc/cr/C-24.2,%20r.%2032)\n\n## Safety first, on the road and online\n\nWe are committed to protecting your personal information and privacy. That’s why, when we collect data, we follow a [Policy on Privacy](https://saaq.gouv.qc.ca/en/policies/privacy) that is responsible and transparent. By continuing to browse without modifying your preferences, you accept the use of cookies.\n\nEdit settingsAcceptReject\n\nDétection du zoom", "metadata": {"title": "Transferring a Vehicle Between Individuals - SAAQ", "description": "If you are buying or selling a used vehicle, it can be registered with a few clicks using SAAQclic. ", "url": "https://saaq.gouv.qc.ca/en/vehicle-registration/registering-vehicle/automobile-motor-home/passenger-vehicle-between-individuals", "language": "en", "keywords": "Vehicle transfer, transferring ownership, used vehicle, selling a used vehicle, buying a used vehicle, vehicle transfer using SAAQclic, mechanical inspection, vehicle history, flood-damaged vehicle, register of personal and movable real rights.", "robots": null, "og_title": "Transferring a Vehicle Between Individuals", "og_description": "Buying or selling a used vehicle? It can be registered with a few clicks using SAAQclic", "og_url": "https://saaq.gouv.qc.ca/en/vehicle-registration/registering-vehicle/automobile-motor-home/passenger-vehicle-between-individuals", "og_image": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/og.png", "og_audio": null, "og_determiner": null, "og_locale": null, "og_locale_alternate": null, "og_site_name": "SAAQ", "og_video": null, "favicon": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/favicon.ico", "dc_terms_created": null, "dc_date_created": null, "dc_date": null, "dc_terms_type": null, "dc_type": null, "dc_terms_audience": null, "dc_terms_subject": null, "dc_subject": null, "dc_description": null, "dc_terms_keywords": null, "modified_time": null, "published_time": null, "article_tag": null, "article_section": null, "source_url": "https://saaq.gouv.qc.ca/en/vehicle-registration/registering-vehicle/automobile-motor-home/passenger-vehicle-between-individuals", "status_code": 200, "scrape_id": "019be619-b73d-7229-9070-6330d7ad1967", "num_pages": null, "content_type": "text/html; charset=utf-8", "proxy_used": "stealth", "timezone": "America/New_York", "cache_state": null, "cached_at": null, "credits_used": 5, "concurrency_limited": false, "concurrency_queue_duration_ms": null, "error": null, "dcterms.creator": "SAAQ", "dcterms.description": "If you are buying or selling a used vehicle, it can be registered with a few clicks using SAAQclic. ", "facebook-domain-verification": "1en4okgbj220os0h290a52lpwyie3b", "og:type": "website", "generator": "TYPO3 CMS", "og:url": "https://saaq.gouv.qc.ca/en/vehicle-registration/registering-vehicle/automobile-motor-home/passenger-vehicle-between-individuals", "og:description": "Buying or selling a used vehicle? It can be registered with a few clicks using SAAQclic", "author": "SAAQ", "twitter:card": "summary", "twitter:title": "Transferring a Vehicle Between Individuals", "og:image": "https://saaq.gouv.qc.ca/_assets/3137b1a864c689786cac76b3def62dd1/Assets/img/og.png", "viewport": "width=device-width, initial-scale=1", "twitter:description": "Buying or selling a used vehicle? It can be registered with a few clicks using SAAQclic", "og:site_name": "SAAQ", "twitter:site": "SAAQ", "og:title": "Transferring a Vehicle Between Individuals", "twitter:url": "https://saaq.gouv.qc.ca/en/vehicle-registration/registering-vehicle/automobile-motor-home/passenger-vehicle-between-individuals", "indexId": "19a2f21f-3421-49ec-b015-91651a017236", "collected_at": "2026-01-22T14:26:40.992422+00:00", "source_type": "html", "source_file": "/home/andalus/self_study/projects/saaq_qa_assistant/data/raw/html_sources/urls.txt", "source_file_id": "/home/andalus/self"}}
